Anteriormente, você praticou como identificar valores nulos e também descobriu como observar as linhas onde estão os valores nulos. Agora, você precisa avançar um pouco mais na identificação dos dados nulos para a manipulação deles com Pandas.

Com o mesmo conjunto de dados do exercício anterior, como você conseguiria identificar quantos valores nulos esse conjunto de dados tem em cada coluna? E como contar a quantidade total de nulos presentes no DataFrame?

In [1]:
import pandas as pd

df = pd.read_csv('../../../../data/activities_1_2_3.csv')
df.head()

,OrderID,CustomerName,Product,Quantity,PricePerUnit,TotalPrice,CustomerRating,OrderDate
0,101,Ana Silva,Smartphone,1,1500,1500,5.0,2025-01-01
1,102,João Santos,Notebook,2,3000,6000,NaN,2025-01-02
2,103,NaN,Headphone,1,200,200,5.0,2025-01-03
3,104,Lucas Pereira,Smartwatch,1,1200,1200,3.0,2025-01-04
4,105,Fernanda Lima,Mouse,3,100,300,4.0,2025-01-05

In [ ]:
# Quantidade de valores nulos por coluna
df.isnull().sum()

OrderID           0
CustomerName      4
Product           0
Quantity          0
PricePerUnit      0
TotalPrice        0
CustomerRating    5
OrderDate         0
dtype: int64

In [4]:
# Contando a quantidade de conjunto de dados nulos por coluna

df.isnull().sum().sum()

np.int64(9)